package com.example.user.univer.TxtLecture;

import android.app.Activity;
import android.os.Bundle;
import android.support.v4.app.NavUtils;
import android.view.View;
import android.widget.ImageButton;
import android.widget.TextView;

import com.example.user.univer.R;

/**
 * Created by user on 14.06.2016.
 */
public class TxtLecture4 extends Activity implements View.OnClickListener {

    private TextView txtTitle, textView;
    private ImageButton btnBack;


    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_txt_lecture);

        txtTitle = (TextView) findViewById(R.id.txtTitle);
        txtTitle.setText("Дүние жүзі халқының саны");

        textView = (TextView) findViewById(R.id.textView);
        textView.setText("Дүние жүзі халқының саны: өте тез өсу  Географтар мен демографтар жұмыстарында  халық  санағы  деректерін  кеңінен  пайдаланады.  XIX   ғасырдын басынан бері дүние жүзінде осындай 2 мыңнан астам санақ өтті. Қазіргі кезеңіде ондай санақтар көпшілік дамыған елдерде 5 немесе 10 жылда бір рет өтіп. Адамзат тарихының бүкіл өн бойына дерлік жердегі халық саны өте баяу жедел өсу жаңа тарих кезеңінде ғана басталды.  Дегенмен, ол ешқашан ХХ ырдың екінші жартысындағыдай тез өсіп көрген жоқ.  Жердегі  халықтың  жыл  сайынғы  абсолют  өсуі  XX  ғасырдың нда   10—15 млн.  адам, орта тұсында 40—50 млн,  адам болса,  біздің (езімізде 75—80 млн. адамға жетті. Бұл өсу ССРО-дан басқа кез келген Еуропалық   мемлекет   тұрғындарының   санынан   әлдеқайда   асып   түседі  шілдеде Югославияда туған ұл бала планетаның бес миллиардыншы  тұрғыны болды. Пайда дүние жүзінің әр түрлі топтары мен аймақтарында халық бірдей.   Бұл   оның  ұдайы   өс.уінің  әр   түрлі   сипатта  болуымен   ба'йланысты. 2. Халықтың ұдайы өсуі туралы ұғым. Халық саны туралы ғылыми теориянь К. Маркс, Ф. Энгельс және В. И. Ленин құрды. Олар еңбек ететін халық  қоғамның басты өндіруші күші, бүкіл қоғамдық өндірістің негізі деп қарады Халық табиғатпен (географиялық ортамен) үнемі өзара әрекеттесе отырып оны қайта түлетуде жетекші орын алады. Сонымен бірге халық жасалып. бүкіл материалдық игіліктің басты түтынушысы болып табылады. Мүш сендердің әрқайсыларың-ақ өз бастарыңнан сезесіңдер. Халықтың сапысы әр елде, қала берді бүкіл адамзаттың дамуының маңызды факторларын болатындығы міне осыдан . Өз кезегінде халық санының өсуі оның ұдайы өсуінің сипатымеі байланысты. Халықтың ұдайы өсуі (табиғи қозғалысы) деп адам ұрпағының үздіксі жаңарып және ауысып отыруын қамтаМасыз ететін туу, өлім және табин өсуінің жиынтығын айтады. Туу, өлім, халықтың табиғи өсуі — тегінде биологиялық процестер. Соғаі қарамастан, оларға адам өмірінің әлеуметтік-экономикалық жағдайлары. сондай-ақ адамдардың қоғамдағы және семьядағы өзара қатынастары щешу әсерін тцгізеді. Өлім деңгейі бәрінен бұрын адам өмірінің материалды жағдайларымен: тамақтануымен, олардың еңбегінің және тұрмысының слпи тарлық-гигиеналық жағдайларымен, денсаулық сақтаудың өркендеуімем байланысты. Туу деңгейі де қоғамның әлеуметтік-экономикалық құрылысымсі адамның тіршілік жағдайларымен байланысты.\n");

        btnBack = (ImageButton) findViewById(R.id.btnBack);
        btnBack.setOnClickListener(this);




    }

    @Override
    public void onClick(View v) {
        switch (v.getId()) {
            case R.id.btnBack:
                NavUtils.navigateUpFromSameTask(this);
                break;

        }
    }
}
