package com.example.user.univer.TxtLecture;

import android.app.Activity;
import android.os.Bundle;
import android.support.v4.app.NavUtils;
import android.view.View;
import android.widget.ImageButton;
import android.widget.TextView;

import com.example.user.univer.R;

/**
 * Created by user on 14.06.2016.
 */
public class TxtLecture33 extends Activity implements View.OnClickListener {

    private TextView txtTitle, textView;
    private ImageButton btnBack;


    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_txt_lecture);

        txtTitle = (TextView) findViewById(R.id.txtTitle);
        txtTitle.setText("Дүниежүзінің табиғат ресурстары");

        textView = (TextView) findViewById(R.id.textView);
        textView.setText("Дүниежүзінің табиғат ресурстары Ресурстарға шаруашылық баға беру. Дүниежүзіндегі елдердің табиғат ресурстарымен қамтамасыз етілу дәрежесі әркелкі. Табиғат ресурстарымен қамтамасыз етілу көрсеткіші алуан түрлі ресурстардың қор мөлшерінің арақатынасымен және оның пайдаланылу ауқымымен байланысты. Дүниежүзілік шаруашылықтың күрделі жүйесінде және еңбектің халықаралық үлестірілуінде экономикасы дамыған елдер, негізінен, тұтынушы болса, ал дамушы елдер — шикізат ресурстарын өндіруші әрі экспорттаушы болып табылады. Дегенмен көптеген жоғары дәрежеде дамыған елдер де ресурстардың ірі қорына ие, олар кейбір ресурс түрлерін өндіруден әлемдік жетекші болуы да мүмкін. Жалпы алғанда, осы айтылғандай дүниежүзілік экономикада мамандану бір жағынан, дүниежүзіндегі елдердің тарихи және әлеуметтік-экономикалық даму деңгейімен, екінші жағынан, жекелеген ресурс түрлерінің Жер шарындағы таралу ерекшеліктерімен түсіндіріледі. Ресурстардың көпшілігі дамушы елдердін, аумақтарында орналасқан. Дүниежүзіндегі табиғат ресурстарының тендестігі, олардың корлары, жағдайы және пайдалану болашағы қосымшадағы 4-кестеде көрсетілген. Осы кестеде теңдестіктің маңызды құрамына жеке-жеке тоқталамыз. Энергетикалық ресурстар. XIX ғасырдың басына дейін негізгі энергетикалык ресурс түрі — ағаш болып келді. Содан соң оның маңызы біртіндеп темендей бастады да, көмірді кеңінен пайдалану байқалды. Дегенмен көмірдің басымдылығы ұзаққа созылмады, себебі оның орнына мұнай мен табиғи газ игеріліп пайдаланылды. Қазіргі замандағы жалпы дүниежүзілік отын қорлары бірінші кезекте көмір қорынан (жылу өндіру мүмкіндігінің 60%-ына дейін), мұнай мен газдан (шамамен 27%) тұрады (2-қосарбеттегі картаны қараңдар). Жалпы әлемдік өндірісте сұраныс басқандай: көмірге шамамен 30%, ал мұнай мен газға 67%-дан артық. 2000 жылы дүниежүзіндегі шынайы мұнай қоры 140 млрд т (жалпы барланғаны 250—300 млрд т) деп анықталған. Оның ішінде ОПЕК (мүнай экспорттаушы елдер ұйымы) елдерінің үлесіне өндірілген мүнай корының 77%-ы тиесілі болды. Дүниежүзілік табиғи газ қоры 146 млрд м3 деңгейінде анықталған. Оның ішінде ОПЕК елдерінің үлесіне табиғи газ корының 41%-ы тиесілі (косымшадағы 14-кестені караңдар). Егер артық айтсақ дүниежүзілік мұнай қоры 200—300 жылға жетеді, ал шындығында колда бар мұнай қоры тек бірнеше жылға ғана жетуі мүмкін. Өйткені мүнай өндіру көлемі жыл сайын артып отыр. Мысалы, 1960 жылдары мүнай мен газ конденсатын өндіру мелшері шамамен 1 млрд т, ал табиғи газ ендірісі 5 трлн м3 болған. Ал 2000 жылы бүл көрсеткіштер тиісінше 3,5 млрд т жонө 23 трлн м3-ге жеткен (косымшаны карандар). Мұнай өндірудің анықталған қоры казіргі кезде дүниежүзі деңгейінде жалпы 40 жылға жетеді деп болжам жасалуда. Бұл көрсеткіш ОПЕК елдері бойынша орташа есеппен 77 жылды құрайды. Сонымен қатар аса ірі ендіргіш елдерде керсеткіш қорлардың қамтамасыз етілуіндегі орташа деңгейінен жоғары. Мысалы, бұл көрсеткіш Сауд Арабиясында шамамен 80 жыл Кувейт пен Біріккен Араб Әмірлігінде 100 жылдан астам және т.б. Көмірдің сапалық кұрамы айтарлықтай маңызға ие, оньщ ішінде кокстелетін көмір ерекше бағаланады. Мұндай көмірдің үлесі Аустралияда, Германпяда. Қытайда және АҚШ-та аса мол. Көптеген елдердегі экологиялык проблемалардың шиеленісуіне және табиғат қорғау шараларының қатаңдануына байланысты кемірдің күкірттілігіне басты назар аударылуда. Дүниежүзіндегі тас көмір өндіру, шамамен, 3,5 млрд т деңгейінде. Соңғы жылдары бірқатар өндіріс жағдайы нашар және ендірілетін кемірдің айтарлықтай белігінің күкірттілігі жоғары елдерде таскөмір өндірісі күшті дағдарыска ұшырады, соның нөтижесінде бұл елдер көмірді сырттан сатьш алуға кешті. Көмір экспорттаушы аса ірі елдер катарына Аустралия, Канада, ОАР, Колумбия сияқты мемлекеттер кіреді.\n");

        btnBack = (ImageButton) findViewById(R.id.btnBack);
        btnBack.setOnClickListener(this);




    }

    @Override
    public void onClick(View v) {
        switch (v.getId()) {
            case R.id.btnBack:
                NavUtils.navigateUpFromSameTask(this);
                break;

        }
    }
}
