package com.example.user.univer.TxtLecture;

import android.app.Activity;
import android.os.Bundle;
import android.support.v4.app.NavUtils;
import android.view.View;
import android.widget.ImageButton;
import android.widget.TextView;

import com.example.user.univer.R;

/**
 * Created by user on 14.06.2016.
 */
public class TxtLecture2 extends Activity implements View.OnClickListener {

    private TextView txtTitle, textView;
    private ImageButton btnBack;


    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_txt_lecture);

        txtTitle = (TextView) findViewById(R.id.txtTitle);
        txtTitle.setText("Дүниежүзілік шаруашылық жүйесі");

        textView = (TextView) findViewById(R.id.textView);
        textView.setText("Дүниежүзілік шаруашылық жүйесі — дүние жүзі елдері ұлттық шаруашылықтарының жиынтығы. Дүниежүзілік шаруашылық жүйесі сыртқы сауда, капиталды сыртқа шығару, жұмыс күшінің көші-қоны, экономикалық келісімшарттар жасау, халықаралық экономикалық ұйымдарды құру, ғылыми-техникалық ақпарат алмасу сияқты өзара экономикалық байланыстар мен өзара қарым-қатынастардан тұрады. Дүниежүзілік шаруашылық жүйесі, негізінен, 19 ғасырдың аяғы мен 20 ғасырдың басында ірі машиналық индустрияның, көліктің және әлемдік рыноктың дамуы нәтижесінде қалыптасты. Дүниежүзілік шаруашылық жүйесінің негізгі саласы — өнеркәсіптердің Дүниежүзілік өнеркәсіпте 20 ғасырдың аяғында шамамен 350 миллионға жуық адам жұмыс істеді. Соңғы жүз жыл ішінде өнеркәсіп өндірісі 50 есе өсті, бұл өсімнің 3/4-і 20 ғасырдың 2-жартысына келеді. Пайда болу уақытына қарай өнеркәсіптің барлық салалары, әдетте, 3 топқа бөлінеді. Бірінші топқа “дәстүрлі” салалар: көмір, тау-кен өндірісі, металлургия, темір жол көлігі, кеме жасау, тоқыма өнеркәсібі; екінші топқа жаңа салалар: автомобиль жасау, алюминий қорыту, пластмасса, химиялық талшықтар өндірісі; үшінші топқа ғылыми-зерттеу жұмыстарын қажет ететін “жоғары технология” салалары: микроэлектроника, есептеуіш техника, робот жасау, информатика индустриясы, атом және аэроғарыш өндірісі, органикалық синтез химиясы, микробиология өнеркәсібі жатады. АҚШ-та, ГФР-де, Ұлыбританияда, Францияда өңдеуші өнеркәсіптің жалпы өнімінің 35 — 40%-і осы 3 топтағы салаларға келеді. Дүниежүзілік шаруашылық жүйесінің негізгі салаларының бірі — отын-энергетика кешені. Бастапқы энергетика байлықтарын дүние жүзі бойынша өндіру және тұтыну ұдайы өсіп келеді. Ол 1900 жыл 1 миллиард тонна шартты отыннан 1990 жыл 10 миллиард тоннаға дейін өсті, ал 2000 жыл 14 миллиард тоннаға жетті. Ауыл шаруашылығы Ауыл шаруашылығы материалдық өндірістің ежелгі әрі кең тараған саласы. Дүние жүзінде ауыл шаруашылығымен және оған шектес орман шаруашылығымен, аңшылықпен, балық аулаумен айналысатын салаларда 1,1 миллиард адам еңбек етеді. Ауыл шаруашылығының барлық жерде таралуы оның алуан түрлілігіне байланысты. Олар үлкен екі топқа біріктіріледі. Біріншісі — дамыған тауарлы ауыл шаруашылығы. Оған ауыспалы егістігі бар интенсивті егіншілік, мал азығын дайындау қоса жүргізілетін интенсивті мал шаруашылығы, сондай-ақ, тыңайған жері және жайылымдық мал шаруашылығы бар экстенсивті егіншілік жатады. Екіншісі — дәстүрлі тұтынушы ауыл шаруашылығы. Ол артта қалған соқалы-теселі егіншілікті, жайылымдық мал шаруашылығын, көшпелі және жартылай көшпелі мал өсіруді, сондай-ақ, бұдан да қарапайым терімшілікті, аңшылық пен балық аулауды қамтиды. Ауыл шаруашылығының басты саласы — өсімдік шаруашылығы. Оның ішінде дәнді дақылдар — дүниежүзілік ауыл шаруашылының негізі, дүние жүзінде өңделетін бүкіл жер аумағының 50%-інен астамын қамтиды. Дәнді дақылдардың дүниежүз. өндірісі бірте-бірте өсіп келеді. Жылына 1,9 миллиард. тоннаға дейін астық жиналады. Дәнді дақылдар, яғни астық шаруашылығын құрайтын үш дақыл — бидай, күріш және жүгері жалпы түсімнің 80%-ін береді және адамдардың бүкіл тамақ энергиясының 50%-ке жуығын қамтамасыз етеді. Бидай — дәнді дақылдардың ең негізгісі және дүние жүзіндегі адам баласының жартысының басты азығы. Ол 70-ке тарта елде өсіріледі. Бірақ жалпы өнімнің басым бөлігі (миллион тонна есебімен): АҚШ (75), Канада (30), Австралия (16), Ресей (45), Қазақстан (17), Украина (20), Қытай (95), Үндістан (50), Франция (32) елдерінің үлесіне тиеді. Күріш — адамзат баласының бидайдан кейінгі негізгі тағамы. 20 ғасырдың аяғында күріш өсірумен жүзге жуық ел айналысқанымен, оның дүниежүзілік түсімінің 90%-ін Азияның “күрішті” елдері береді. Ірі күріш өндіретін елдер (миллион тонна есебімен): Қытай (180), Үндістан (110), Бангладеш (20), Таиланд (21), Индонезия (45). Дүние жүзіндегі суармалы жерлердің 60 — 65%-іне күріш егіледі. Жүгері өндіру Мексикада басталып, кейін дүние жүзінің басқа аудандарына да тарады. Қазіргі кезде жүгеріні негізгі өндіруші елдер — АҚШ, Қытай және Бразилия. Әлемдік рынокқа дүние жүзінде өндірілетін астықтың, негізінен, бидай \n");

        btnBack = (ImageButton) findViewById(R.id.btnBack);
        btnBack.setOnClickListener(this);




    }

    @Override
    public void onClick(View v) {
        switch (v.getId()) {
            case R.id.btnBack:
                NavUtils.navigateUpFromSameTask(this);
                break;

        }
    }
}
