package com.example.user.univer.TxtLecture;

import android.app.Activity;
import android.os.Bundle;
import android.support.v4.app.NavUtils;
import android.view.View;
import android.widget.ImageButton;
import android.widget.TextView;

import com.example.user.univer.R;

/**
 * Created by user on 14.06.2016.
 */
public class TxtLecture77 extends Activity implements View.OnClickListener {

    private TextView txtTitle, textView;
    private ImageButton btnBack;


    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_txt_lecture);

        txtTitle = (TextView) findViewById(R.id.txtTitle);
        txtTitle.setText("Аустралия материгі");

        textView = (TextView) findViewById(R.id.textView);
        textView.setText("Аустралия –оңтүстік жартышарда орналасқан Жер шарындағы ең кіші материк. Аустралия мемлекеті жер көлемі жөнінен жер шарында алтыншы орын алады. Материктің ауданы, маңындағы аралдармен қоса есептегенде 7,6 млн шаршы шақырым. Аустралия материгі Жер шарындағы ең аласа материк, оның теңіз деңгейінен орташа биіктігі 215 м Аустралия материгін бір ғана ел – Аустралия Одағы алып жатыр. Халқының саны – 22 млн адам. Астанасы – Канберра қаласы, тұрғын халқы 309 мың адам. Мемлекетті Ұлыбритания королевасы басқарады. Мемлекетттік құрылымы жөнінен Британ бірлестігі құрамына кіретін мемлекет. Ұлыбритания басқаратын Достастыққа дүниежүзі бойынша 50 мемлекет кіреді. Аустралия әкімшілік-аумақтық құрылым бойынша федералды ел болып саналады. Аустралия 6 штаттан және 2 аумақтан тұрады. Аустралияның байырғы халқы – аборигендер аңшылықпен және жеуге жарамды өсімдіктердің тамырын жинаумен күнелткен. Қазіргі кезде Аустралия халқының тек 1-н ғана аборигендер құрайды, оларды жалпы саны 160 мың адам. Аустралия халқының 97ын ағылшын аустралиялықтар құрайды. Екінші дүниежүзілік соғыс кезінде Ұлыбритания мен Ирландиядан қоныс аударушылар есебінен Аустралия халқының саны күрт өсті. Аустралия дүниежүзі бойынша жоғары урбандалған материк қатарына жатады. Аустралиядағы қала халқының үлесі 83-ды құрайды. Халқы Аустралияның Мельбурн, Сидней секілді ірі қалалары маңына шоғырланған. Аустралия минералды ресурстарға өте бай. Аустралия ежелгі гондваналық платформада орналасқандықтан, боксит, қорғасын, темір, никель, уран кендеріне өте бай. Аустралия өнеркәсібінің жетекші саласы тау-кен өнерекәсібі. Тау-кен өнеркәсібі елдегі өнеркәсіп өнімінің 13-н береді. Тау-кен өнеркәсібінің басты орталығы – Аустралияның оңтүстік-шығысында орналасқан Брокен Хилл қаласы. Бұл қалада полиметалл кен өндірісі дамыған. Аустралияда машина жасау саласы да біршама дамыған. Машина жасау өнеркәсібі тау-кен өнеркәсібіне, тамақ өнеркәсібіне қажетті құрал-жабдықтар шығарады. Аустралиядағы машина жасаудың ірі орталықтары Сидней, Мельбурн, Аделаида, Брисбен қалалары болып саналады. Аустралияда ауылшаруашылығы жоғары деңгейде автоматтандырылған. Аустралияның өсімдік шаруашылығының жетекші саласы – бидай өсіру. Бидай егістіктері Аустралияның оңтүстік батысы мен оңтүстік шығысын алып жатыр. Мұхит аралдарының ішіндегі ең ірі, шаруашылығы жақсы дамыған ел – Жаңа Зеландия. Жаңа Зеландия жері екі үлкен арал мен көптеген ұсақ аралдардан тұрады. Жаңа Зеландияда қой шаруашылығы дамыған. Бүкіл адамзат басындағы шешімі барлық елдердің бірігіп күш жұмсауын талап ететін проблемаларды ғаламдық проблемалар деп атайды. Ғаламдық проблемаларға бейбітшілік сақтау, азық-түлік, экология проблемалары т.б. жатады. Адамзаттың ғаламдық проблемалары арасындағы ең басты орын бейбітшілік сақтау проблемасы. Себебі адамзат санының қысқаруына, ең алдымен, әскери соғыс қимылдары әсер еткен. Адам баласының ядролық қаруды ойлап табуымен бірнеше минутта жер бетіндегі тіршілікті жойып жіберу қаупі төнді. Бейбітшілікті сақтау мақсатында кейбір елдер ядролық қарудан бас тартуда. Қазақстан Республикасы ядролық қарудан өз еркімен бас тартқан дүниежүзіндегі бірден-бір ел болып саналады. Милитаризм латын тілінен аударғанда деген мағына береді. Елдердің әскери қуатын арттыруға бағытталған іс-шаралар жүйесін милитаризм деп атайды. Атмосферада көмірқышқыл газының үлесінің артуын жылыжай эффектісі деп атайды. Көмірқышқыл газы жер бетінен бөлінетін жылуды өткізбейтіндіктен, климат жылынады.  Ғалымдардың есептеуі бойынша, Дүниежүзілік мұхиттың байлықтары жер шарындағы 20 млрд адамды асырауға жетеді Бірақ қазір мұхит байлықтары адамзаттың азық-түлік қорының тек 2%-н ғана құрайды. 1982 жылы БҰҰ-ның теңіз құқы жөніндегі Теңіз хартиясы деп аталатын Конвенциясы қабылданды. Конвенция бойынша 200 мильдік экономикалық аймақты белгілеп, жағалық мемлекеттердің мұхиттың биологиялық және минералдық қорларды пайдалануға құқы бар екенін анықтап берді.");

        btnBack = (ImageButton) findViewById(R.id.btnBack);
        btnBack.setOnClickListener(this);




    }

    @Override
    public void onClick(View v) {
        switch (v.getId()) {
            case R.id.btnBack:
                NavUtils.navigateUpFromSameTask(this);
                break;

        }
    }
}
